Sancaros/PSOSERVER/游戏库/libpsocnconfig/psoconfig.c
/*
    梦幻之星中国 设置文件.
    版权 (C) 2022 Sancaros

    This program is free software: you can redistribute it and/or modify
    it under the terms of the GNU Affero General Public License version 3
    as published by the Free Software Foundation.

    This program is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU Affero General Public License for more details.

    You should have received a copy of the GNU Affero General Public License
    along with this program.  If not, see <http://www.gnu.org/licenses/>.
*/

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <errno.h>
#include <direct.h>
#include <urlmon.h>
#include <time.h>
#include <locale.h>

#include "WinSock_Defines.h"

#include <libxml/xmlwriter.h>
#include <libxml/tree.h>
#include <libxml/parser.h>
#include <libxml/xmlstring.h>

#include "psoconfig.h"
#include "f_logs.h"
#include "debug.h"

#ifndef LIBXML_TREE_ENABLED
#error You must have libxml2 with tree support built-in.
#endif

#define XC (const xmlChar *)

char ipbuf[32] = { 0 };

/* The list of language codes */
#define LANGUAGE_CODE_COUNT     8

static const char language_codes[LANGUAGE_CODE_COUNT][3] = {
    "jp", "en", "de", "fr", "es", "cs", "ct", "kr"
};

char* int2ipstr(const int ip)
{
    sprintf(ipbuf, "%u.%u.%u.%u",
        (char)*((char*)&ip + 0),
        (char)*((char*)&ip + 1),
        (char)*((char*)&ip + 2),
        (char)*((char*)&ip + 3));
    return ipbuf;
};

/*
* 	地址为IP返回true 其他返回false
*/
int32_t server_is_ip(char* server)
{
    char ip[4][4] = { 0 };
    int32_t ip_i = 0;
    char* ptr = server;
    int32_t ptr_i = 0;
    int32_t ptr_len = strlen(server);

    if (NULL == server || 15 < ptr_len)
        return 0;

    //检查IP范围
    for (int i = 0; i < 4; i++)
    {
        ip_i = 0;
        for (int j = 0; j < 4; j++)
        {
            //1.字符为0-9的数字
            if (3 != j && isdigit(ptr[ptr_i]))
            {
                ip[i][ip_i++] = ptr[ptr_i++];
            }
            //2.字符为'.'分隔符
            else if (3 != i && 0 != j && '.' == ptr[ptr_i])
            {
                ip[i][ip_i++] = '\0';
                ptr_i++;
                break;
            }
            else
            {
                return 0;
            }
            //3.结束
            if (ptr_len <= ptr_i)
            {
                if (3 == i)
                    break;
                else
                    return 0;
            }
        }
    }
    //检查IP格式
    for (int z = 0; z < 4; z++)
        if (atoi(ip[z]) > 255)
            return 0;
    return 1;
}

#define False 0
#define True 1

int checkIPV4(char* ip)
{
    int sepNum;
    if (ip[0] == '0' || ip[0] == '.' || strlen(ip) > 3 || strlen(ip) == 0)
        return False;
    sepNum = atoi(ip);
    if (sepNum == 0 || sepNum > 255)
        return False;
    return True;
}

int checkIPV6(char* ip)
{
    size_t i = 0;
    if (ip[0] == ':' || strlen(ip) > 4 || strlen(ip) == 0)
        return False;
    for (i = 0; i < strlen(ip); i++)
    {
        if ((ip[i] >= '0' && ip[i] <= '9') || (ip[i] >= 'a' && ip[i] <= 'f') || (ip[i] >= 'A' && ip[i] <= 'F'))
            continue;
        else
            return False;
    }
    return True;
}

int check_ipaddr(char* IP)
{
    if (IP == NULL)
        return 0;
    char* cur, * pre;
    char ip[10] = { 0 };
    char len = 0;
    if (strchr(IP, '.'))
    {
        pre = IP;
        cur = strchr(IP, '.');    //找到'.'的位置
        while (cur)
        {
            memcpy(ip, pre, cur - pre);    //取出两个'.'之间的字符
            if (checkIPV4(ip) == False)
                return 0;
            pre = cur + 1;
            cur = strchr(pre, '.');
            memset(ip, 0, 10);
            len++;
            if (len > 3)        //判断分组是否符合ipv4要求
                return 0;
        }
        if (len != 3)
            return 0;
        memcpy(ip, pre, strlen(pre));
        if (checkIPV4(ip) == False)
            return 0;
        return 1;
    }
    else if (strchr(IP, ':'))
    {
        pre = IP;
        cur = strchr(IP, ':');
        while (cur)
        {
            memcpy(ip, pre, cur - pre);
            if (checkIPV6(ip) == False)
                return 0;
            pre = cur + 1;
            cur = strchr(pre, ':');
            memset(ip, 0, 10);
            len++;
            if (len > 7)
                return 0;
        }
        if (len != 7)
            return 0;
        memcpy(ip, pre, strlen(pre));
        if (checkIPV6(ip) == False)
            return 0;
        return 1;
    }

    return 0;
}

//static int handle_server(xmlNode* n, psocn_config_t* cur) {
//    xmlChar* addr4, * addr6, * ip4, * ip6;
//    int rv;
//
//    /* Grab the attributes of the tag. */
//    addr4 = xmlGetProp(n, XC"addr4");
//    addr6 = xmlGetProp(n, XC"addr6");
//    ip4 = xmlGetProp(n, XC"ip4");
//    ip6 = xmlGetProp(n, XC"ip6");
//
//    /* Make sure we have what we need... */
//    if (!ip4 || !addr4) {
//        ERR_LOG("服务器域名或IP未填写");
//        rv = -1;
//        goto err;
//    }
//
//    cur->srvcfg.host4 = (char*)addr4;
//
//    //CONFIG_LOG("检测域名获取: %s", host4);
//
//    if (check_ipaddr((char*)ip4)) {
//        /* Parse the IP address out */
//        rv = inet_pton(PF_INET, (char*)ip4, &cur->srvcfg.server_ip);
//        //ERR_LOG("IP串码 %d rv = %d", &cur->server_ip, rv);
//        if (rv < 1) {
//            ERR_LOG("未获取到正确的 IP 地址: %s",
//                (char*)ip4);
//            rv = -2;
//            goto err;
//        }
//    }
//
//    /* See if we have a configured IPv6 address */
//    if (ip6 || addr6) {
//
//        cur->srvcfg.host6 = (char*)addr6;
//
//        if (ip6) {
//            rv = inet_pton(PF_INET6, (char*)ip6, cur->srvcfg.server_ip6);
//
//            /* This isn't actually fatal, for now, anyway. */
//            if (rv < 1) {
//                //ERR_LOG("无效 IPv6 地址: %s", (char*)ip6);
//            }
//        }
//    }
//
//    rv = 0;
//
//err:
//    xmlFree(addr4);
//    xmlFree(addr6);
//    xmlFree(ip4);
//    xmlFree(ip6);
//    return rv;
//}
//
//static int handle_database(xmlNode* n, psocn_config_t* cur) {
//    xmlChar* type, * host, * user, * pass, * db, * port, * rec, * char_set, * showsetting;
//    int rv;
//    unsigned long rv2;
//
//    /* Grab the attributes of the tag. */
//    type = xmlGetProp(n, XC"type");
//    host = xmlGetProp(n, XC"host");
//    user = xmlGetProp(n, XC"user");
//    pass = xmlGetProp(n, XC"pass");
//    db = xmlGetProp(n, XC"db");
//    port = xmlGetProp(n, XC"port");
//    rec = xmlGetProp(n, XC"auto_reconnect");
//    char_set = xmlGetProp(n, XC"char_set");
//    showsetting = xmlGetProp(n, XC"show_setting");
//
//    /*printf("type = %s host = %s user = %s pass = %s db = %s port = %s rec = %s char_set = %s\n",
//        type, host, user, pass, db, port, rec, char_set);*/
//
//    /* Make sure we have all of them... */
//    if (!type || !host || !user || !pass || !db || !port || !rec || !char_set || !showsetting) {
//        ERR_LOG("数据库设置不完整");
//        rv = -1;
//        goto err;
//    }
//
//    /* Copy out the strings */
//    cur->dbcfg.type = (char*)type;
//    cur->dbcfg.host = (char*)host;
//    cur->dbcfg.user = (char*)user;
//    cur->dbcfg.pass = (char*)pass;
//    cur->dbcfg.db = (char*)db;
//    cur->dbcfg.auto_reconnect = (char*)rec;
//    cur->dbcfg.char_set = (char*)char_set;
//    cur->dbcfg.show_setting = (char*)showsetting;
//
//
//    /* Parse the port out */
//    rv2 = strtoul((char*)port, NULL, 0);
//
//    //ERR_LOG("数据库端口: %u", rv2);
//
//    if (rv2 == 0 || rv2 > 0xFFFF) {
//        ERR_LOG("无效数据库端口: %s", (char*)port);
//        rv = -3;
//        goto err;
//    }
//
//    cur->dbcfg.port = (uint16_t)rv2;
//    rv = 0;
//
//err:
//    xmlFree(type);
//    xmlFree(host);
//    xmlFree(user);
//    xmlFree(pass);
//    xmlFree(db);
//    xmlFree(port);
//    xmlFree(rec);
//    xmlFree(char_set);
//    xmlFree(showsetting);
//    return rv;
//}

