Sancaros/PSOSERVER/游戏库/libpsocnconfig/psoconfig.c
static int handle_web_server(xmlNode* n, psocn_config_t* cur) {
    xmlChar* web_host, * web_port, * web_patch_motd, * web_login_motd;
    int rv;
    unsigned long rv2;

    /* Grab the attributes of the tag. */
    web_host = xmlGetProp(n, XC"web_host");
    web_port = xmlGetProp(n, XC"web_port");
    web_patch_motd = xmlGetProp(n, XC"web_patch_motd");
    web_login_motd = xmlGetProp(n, XC"web_login_motd");

    /* Make sure we have what we need... */
    if (web_host) {
        cur->w_motd.web_host = (char*)web_host;

        /* Parse the port out */
        rv2 = strtoul((char*)web_port, NULL, 0);

        if (rv2 == 0 || rv2 > 0xFFFF) {
            ERR_LOG("无效网络服务器端口: %s", (char*)web_port);
            rv = -3;
        }

        cur->w_motd.web_port = (uint16_t)rv2;

        cur->w_motd.patch_welcom_file = (char*)web_patch_motd;
        cur->w_motd.login_welcom_file = (char*)web_login_motd;

        if (0 == psocn_web_server_getfile(cur->w_motd.web_host, cur->w_motd.web_port, cur->w_motd.login_welcom_file, Welcome_Files[1])) {
            CONFIG_LOG("获取登录欢迎信息成功");
            psocn_web_server_loadfile(Welcome_Files[1], &cur->w_motd.login_welcom[0]);
        }
        else {
            ERR_LOG("获取登录欢迎信息失败");
        }

        if (0 == psocn_web_server_getfile(cur->w_motd.web_host, cur->w_motd.web_port, cur->w_motd.patch_welcom_file, Welcome_Files[0])) {
            CONFIG_LOG("获取补丁欢迎信息成功");
            psocn_web_server_loadfile(Welcome_Files[0], &cur->w_motd.patch_welcom[0]);
        }
        else {
            ERR_LOG("获取补丁欢迎信息失败");
        }

    }
    else {
        ERR_LOG("未开启网络服务器");
        rv = 0;
    }

    rv = 0;

    return rv;
}

static int handle_shipgate(xmlNode* n, psocn_config_t* cur) {
    xmlChar* port, * cert, * key, * ca;
    int rv = 0;
    unsigned long rv2;

    /* Grab the attributes of the tag. */
    port = xmlGetProp(n, XC"port");
    cert = xmlGetProp(n, XC"cert");
    key = xmlGetProp(n, XC"key");
    ca = xmlGetProp(n, XC"ca-cert");

    /* Make sure we have what we need... */
    if (!port || !cert || !key || !ca) {
        ERR_LOG("船闸设置参数不完整");
        rv = -1;
        goto err;
    }

    /* Parse the port out */
    rv2 = strtoul((char*)port, NULL, 0);

    if (rv2 == 0 || rv2 > 0xFFFF) {
        ERR_LOG("船闸端口无效: %s", (char*)port);
        rv = -3;
        goto err;
    }

    cur->sgcfg.shipgate_port = (uint16_t)rv2;

    /* Grab the certificate file */
    cur->sgcfg.shipgate_cert = (char*)cert;
    cur->sgcfg.shipgate_key = (char*)key;
    cur->sgcfg.shipgate_ca = (char*)ca;

    //ERR_LOG("%s", cur->shipgate_cert);

err:
    if (rv < 0) {
        xmlFree(ca);
        xmlFree(key);
        xmlFree(cert);
    }

    xmlFree(port);
    return rv;
}

static int handle_quests(xmlNode* n, psocn_config_t* cur) {
    xmlChar* fn;

    /* Grab the directory, if given */
    if ((fn = xmlGetProp(n, XC"dir"))) {
        cur->quests_dir = (char*)fn;
        return 0;
    }

    /* If we don't have either, report the error */
    ERR_LOG("Malformed quest tag, no dir given");
    return -1;
}

static int handle_limits(xmlNode* n, psocn_config_t* cur) {
    xmlChar* fn, * name, * enforce, * id;
    int enf = 0, i;
    void* tmp;
    unsigned long idn = 0xFFFFFFFF;

    /* Grab the attributes of the tag. */
    id = xmlGetProp(n, XC"id");
    fn = xmlGetProp(n, XC"file");
    name = xmlGetProp(n, XC"name");
    enforce = xmlGetProp(n, XC"enforce");

    /* Make sure we have the data */
    if (!fn) {
        ERR_LOG("Limits file not given in limits tag.");
        goto err;
    }

    if ((!id && name) || (id && !name)) {
        ERR_LOG("Must give both or none of id and name for limits.");
        goto err;
    }

    if (enforce) {
        if (!xmlStrcmp(enforce, XC"true")) {
            enf = 1;
        }
        else if (xmlStrcmp(enforce, XC"false")) {
            ERR_LOG("Invalid enforce value for limits file: %s",
                (char*)enforce);
            goto err;
        }
    }
    /* This is really !id && !name, but per the above, if one is not set, then
       the other must not be set either, so this works. */
    else if (!id) {
        enf = 1;
    }

    /* Make sure we don't already have an enforced limits file. */
    if (enf && cur->limits_enforced != -1) {
        ERR_LOG("Cannot have more than one enforced limits file!");
        goto err;
    }

    if (id) {
        /* Parse the id out */
        idn = (uint32_t)strtoul((char*)id, NULL, 0);

        if (idn < 0x80000000 || idn > 0xFFFFFFFF) {
            ERR_LOG("Invalid id given for limits: %s", (char*)id);
            goto err;
        }

        /* Check for duplicate IDs. */
        for (i = 0; i < cur->limits_count; ++i) {
            if (cur->limits[i].id == idn) {
                ERR_LOG("Duplicate id given for limits: %s",
                    (char*)id);
                goto err;
            }
        }
    }

    /* Allocate space for it in the array. */
    if (!(tmp = realloc(cur->limits, (cur->limits_count + 1) *
        sizeof(psocn_limit_config_t)))) {
        ERR_LOG("Cannot allocate space for limits file: %s",
            strerror(errno));
        goto err;
    }

    /* Copy it over to the struct */
    cur->limits = (psocn_limit_config_t*)tmp;
    cur->limits[cur->limits_count].id = idn;
    cur->limits[cur->limits_count].name = (char*)name;
    cur->limits[cur->limits_count].filename = (char*)fn;
    cur->limits[cur->limits_count].enforce = enf;

    if (enf)
        cur->limits_enforced = cur->limits_count;

    ++cur->limits_count;

    xmlFree(enforce);
    xmlFree(id);

    return 0;

err:
    xmlFree(id);
    xmlFree(fn);
    xmlFree(name);
    xmlFree(enforce);
    return -1;
}

static int handle_info(xmlNode* n, psocn_config_t* cur, int is_motd) {
    xmlChar* fn, * desc, * gc, * ep3, * bb, * lang, * xb;
    void* tmp;
    int rv = 0, count = cur->info_file_count, i, done = 0;
    char* lasts = { 0 }, * token;

    /* Grab the attributes of the tag. */
    fn = xmlGetProp(n, XC"file");
    desc = xmlGetProp(n, XC"desc");
    gc = xmlGetProp(n, XC"gc");
    ep3 = xmlGetProp(n, XC"ep3");
    bb = xmlGetProp(n, XC"bb");
    lang = xmlGetProp(n, XC"languages");
    xb = xmlGetProp(n, XC"xbox");

    /* Make sure we have all of them... */
    if (!fn || !gc || !ep3 || !bb) {
        ERR_LOG("标签设置不完整");
        rv = -1;
        goto err;
    }

