Sancaros/PSOSERVER/游戏库/libpsocnconfig/psoconfig.c
    if (!desc && !is_motd) {
        ERR_LOG("标签设置不完整");
        rv = -1;
        goto err;
    }
    else if (desc && is_motd) {
        ERR_LOG("MOTD 无需拥有描述! 忽略.");
    }

    /* Allocate space for the new description. */
    tmp = realloc(cur->info_files, (count + 1) * sizeof(psocn_info_file_t));
    if (!tmp) {
        ERR_LOG("Couldn't allocate space for info file");
        perror("realloc");
        rv = -2;
        goto err;
    }

    cur->info_files = (psocn_info_file_t*)tmp;

    /* Copy the data in */
    cur->info_files[count].versions = 0;
    cur->info_files[count].filename = (char*)fn;
    cur->info_files[count].desc = (char*)desc;

    /* Fill in the applicable versions */
    if (!xmlStrcmp(gc, XC"true"))
        cur->info_files[count].versions |= PSOCN_INFO_GC;

    if (!xmlStrcmp(ep3, XC"true"))
        cur->info_files[count].versions |= PSOCN_INFO_EP3;

    if (!xmlStrcmp(bb, XC"true"))
        cur->info_files[count].versions |= PSOCN_INFO_BB;

    if (xb && !xmlStrcmp(xb, XC"true"))
        cur->info_files[count].versions |= PSOCN_INFO_XBOX;

    /* Parse the languages string, if given. */
    if (lang) {
        token = strtok_s((char*)lang, ", ", &lasts);

        while (token) {
            for (i = 0; i < LANGUAGE_CODE_COUNT && !done; ++i) {
                if (!strcmp(token, language_codes[i])) {
                    cur->info_files[count].languages |= (1 << i);
                    done = 1;
                }
            }

            if (!done) {
                ERR_LOG("Ignoring unknown language in info/motd tag on "
                    "line %hu: %s", n->line, token);
            }

            done = 0;
            token = strtok_s(NULL, ", ", &lasts);
        }
    }
    else {
        cur->info_files[count].languages = 0xFFFFFFFF;
    }

    ++cur->info_file_count;

    xmlFree(xb);
    xmlFree(lang);
    xmlFree(bb);
    xmlFree(ep3);
    xmlFree(gc);

    return 0;

err:
    xmlFree(xb);
    xmlFree(lang);
    xmlFree(bb);
    xmlFree(ep3);
    xmlFree(gc);
    xmlFree(fn);
    xmlFree(desc);
    return rv;
}

static int handle_log(xmlNode* n, psocn_config_t* cur) {
    xmlChar* dir, * pfx;

    /* Grab the data from the tag */
    dir = xmlGetProp(n, XC"dir");
    pfx = xmlGetProp(n, XC"prefix");

    /* If we don't have the directory, report an error */
    if (!dir) {
        ERR_LOG("Malformed log tag, no dir given");
        goto err;
    }

    /* If no prefix was given, then blank it out. */
    if (!pfx) {
        pfx = (xmlChar*)xmlMalloc(1);
        pfx[0] = 0;
    }

    /* Save the data to the configuration struct. */
    cur->log_dir = (char*)dir;
    cur->log_prefix = (char*)pfx;
    return 0;

err:
    xmlFree(dir);
    xmlFree(pfx);
    return -1;
}

static int handle_patch(xmlNode* n, psocn_config_t* cur) {
    xmlChar* fn;

    /* Grab the directory, if given */
    if ((fn = xmlGetProp(n, XC"dir"))) {
        cur->patch_dir = (char*)fn;
        return 0;
    }

    /* If we don't have the directory, report the error */
    ERR_LOG("Malformed patch tag, no dir given");
    return -1;
}

static int handle_scripts(xmlNode* n, psocn_config_t* cur) {
    xmlChar* fn;

    /* Grab the files, if given */
    if ((fn = xmlGetProp(n, XC"shipgate")))
        cur->sg_scripts_file = (char*)fn;
    if ((fn = xmlGetProp(n, XC"auth")))
        cur->auth_scripts_file = (char*)fn;

    return 0;
}

static int handle_socket(xmlNode* n, psocn_config_t* cur) {
    xmlChar* fn;

    /* Grab the directory, if given */
    if ((fn = xmlGetProp(n, XC"dir"))) {
        cur->socket_dir = (char*)fn;
        return 0;
    }

    ERR_LOG("socket 套接字设置格式错误,未提供目录");
    return -1;
}

static int handle_registration(xmlNode* n, psocn_config_t* cur) {
    xmlChar* t;

    /* Grab the attributes, if given. */
    if ((t = xmlGetProp(n, XC"dc"))) {
        if (!xmlStrcmp(t, XC"true")) {
            cur->registration_required |= PSOCN_REG_DC;
        }
        else if (xmlStrcmp(t, XC"false")) {
            xmlFree(t);
            return -1;
        }

        xmlFree(t);
    }

    if ((t = xmlGetProp(n, XC"dcnte"))) {
        if (!xmlStrcmp(t, XC"false")) {
            cur->registration_required &= ~PSOCN_REG_DCNTE;
        }
        else if (xmlStrcmp(t, XC"true")) {
            xmlFree(t);
            return -1;
        }

        xmlFree(t);
    }

    if ((t = xmlGetProp(n, XC"pc"))) {
        if (!xmlStrcmp(t, XC"false")) {
            cur->registration_required &= ~PSOCN_REG_PC;
        }
        else if (xmlStrcmp(t, XC"true")) {
            xmlFree(t);
            return -1;
        }

        xmlFree(t);
    }

    if ((t = xmlGetProp(n, XC"gc"))) {
        if (!xmlStrcmp(t, XC"false")) {
            cur->registration_required &= ~PSOCN_REG_GC;
        }
        else if (xmlStrcmp(t, XC"true")) {
            xmlFree(t);
            return -1;
        }

        xmlFree(t);
    }

    if ((t = xmlGetProp(n, XC"xbox"))) {
        if (!xmlStrcmp(t, XC"false")) {
            cur->registration_required &= ~PSOCN_REG_XBOX;
        }
        else if (xmlStrcmp(t, XC"true")) {
            xmlFree(t);
            return -1;
        }

        xmlFree(t);
    }

    if ((t = xmlGetProp(n, XC"bb"))) {
        if (!xmlStrcmp(t, XC"false")) {
            cur->registration_required &= ~PSOCN_REG_BB;
        }
        else if (xmlStrcmp(t, XC"true")) {
            xmlFree(t);
            return -1;
        }

        xmlFree(t);
    }

    return 0;
}

void psocn_free_config(psocn_config_t* cfg) {
    int i;

    /* Make sure we actually have a valid configuration pointer. */
    if (cfg) {
        for (i = 0; i < cfg->info_file_count; ++i) {
            xmlFree(cfg->info_files[i].filename);
            xmlFree(cfg->info_files[i].desc);
        }

        for (i = 0; i < cfg->limits_count; ++i) {
            xmlFree(cfg->limits[i].filename);
            xmlFree(cfg->limits[i].name);
        }

        /* Clean up the pointers */
        xmlFree(cfg->dbcfg.type);
        xmlFree(cfg->dbcfg.host);
        xmlFree(cfg->dbcfg.user);
        xmlFree(cfg->dbcfg.pass);
        xmlFree(cfg->dbcfg.db);
        xmlFree(cfg->dbcfg.auto_reconnect);
        xmlFree(cfg->dbcfg.char_set);
        xmlFree(cfg->dbcfg.show_setting);
        xmlFree(cfg->sgcfg.shipgate_cert);
        xmlFree(cfg->sgcfg.shipgate_key);
        xmlFree(cfg->sgcfg.shipgate_ca);
        xmlFree(cfg->quests_dir);
        xmlFree(cfg->log_dir);
        xmlFree(cfg->log_prefix);
        xmlFree(cfg->patch_dir);
        xmlFree(cfg->sg_scripts_file);
        xmlFree(cfg->auth_scripts_file);
        xmlFree(cfg->socket_dir);

