Sancaros/PSOSERVER/游戏库/libpsocnconfig/psoconfig.c
        free_safe(cfg->info_files);
        free_safe(cfg->limits);

        /* Clean up the base structure. */
        free_safe(cfg);
    }
}

int psocn_read_config(const char* f, psocn_config_t** cfg) {
    xmlParserCtxtPtr cxt;
    xmlDoc* doc;
    xmlNode* n;
    int irv = 0;
    psocn_config_t* rv;

    /* Allocate space for the base of the config. */
    rv = (psocn_config_t*)malloc(sizeof(psocn_config_t));

    if (!rv) {
        *cfg = NULL;
        ERR_LOG("无法为设置分配内存空间");
        perror("malloc");
        return -1;
    }

    /* Clear out the config. */
    memset(rv, 0, sizeof(psocn_config_t));
    rv->limits_enforced = -1;
    rv->registration_required = PSOCN_REG_DCNTE | PSOCN_REG_PC |
        PSOCN_REG_GC | PSOCN_REG_XBOX | PSOCN_REG_BB;

    /* Create an XML Parsing context */
    cxt = xmlNewParserCtxt();
    if (!cxt) {
        ERR_LOG("无法为配置创建分析上下文");
        irv = -2;
        goto err;
    }

    /* Open the configuration file for reading. */
    if (f) {
        doc = xmlReadFile(f, NULL, XML_PARSE_DTDVALID);
    }
    else {
        doc = xmlReadFile(psocn_global_cfg, NULL, XML_PARSE_DTDVALID);
    }

    if (!doc) {
        xmlParserError(cxt, "分析配置文件出错");
        irv = -3;
        goto err_cxt;
    }

    /* Make sure the document validated properly. */
    if (!cxt->valid) {
        xmlParserValidityError(cxt, "分析配置文件有效性错误");
        irv = -4;
        goto err_doc;
    }

    /* If we've gotten this far, we have a valid document, now go through and
       add in entries for everything... */
    n = xmlDocGetRootElement(doc);

    if (!n) {
        ERR_LOG("配置文件为空");
        irv = -5;
        goto err_doc;
    }

    /* Make sure the config looks sane. */
    if (xmlStrcmp(n->name, XC"psocn_global_config")) {
        ERR_LOG("配置类型错误");
        irv = -6;
        goto err_doc;
    }

    n = n->children;
    while (n) {
        if (n->type != XML_ELEMENT_NODE) {
            /* Ignore non-elements. */
            n = n->next;
            continue;
        }
        /*else if (!xmlStrcmp(n->name, XC"server")) {
            if (handle_server(n, rv)) {
                irv = -7;
                goto err_doc;
            }
        }
        else if (!xmlStrcmp(n->name, XC"database")) {
            if (handle_database(n, rv)) {
                irv = -8;
                goto err_doc;
            }
        }*/
        else if (!xmlStrcmp(n->name, XC"quests")) {
            if (handle_quests(n, rv)) {
                irv = -9;
                goto err_doc;
            }
        }
        else if (!xmlStrcmp(n->name, XC"limits")) {
            if (handle_limits(n, rv)) {
                irv = -10;
                goto err_doc;
            }
        }
        else if (!xmlStrcmp(n->name, XC"info")) {
            if (handle_info(n, rv, 0)) {
                irv = -11;
                goto err_doc;
            }
        }
        else if (!xmlStrcmp(n->name, XC"motd")) {
            if (handle_info(n, rv, 1)) {
                irv = -12;
                goto err_doc;
            }
        }
        else if (!xmlStrcmp(n->name, XC"shipgate")) {
            if (handle_shipgate(n, rv)) {
                irv = -13;
                goto err_doc;
            }
        }
        else if (!xmlStrcmp(n->name, XC"log")) {
            if (handle_log(n, rv)) {
                irv = -14;
                goto err_doc;
            }
        }
        else if (!xmlStrcmp(n->name, XC"patch")) {
            if (handle_patch(n, rv)) {
                irv = -15;
                goto err_doc;
            }
        }
        else if (!xmlStrcmp(n->name, XC"scripts")) {
            if (handle_scripts(n, rv)) {
                irv = -16;
                goto err_doc;
            }
        }
        else if (!xmlStrcmp(n->name, XC"socket")) {
            if (handle_socket(n, rv)) {
                irv = -17;
                goto err_doc;
            }
        }
        else if (!xmlStrcmp(n->name, XC"registration_required")) {
            if (handle_registration(n, rv)) {
                irv = -18;
                goto err_doc;
            }
        }
        else if (!xmlStrcmp(n->name, XC"web_server")) {
            if (handle_web_server(n, rv)) {
                irv = -19;
                goto err_doc;
            }
        }
        else {
            ERR_LOG("无效设置标签 %s 设置行 %hu", (char*)n->name,
                n->line);
        }

        n = n->next;
    }

    *cfg = rv;

    /* Cleanup/error handling below... */
err_doc:
    xmlFreeDoc(doc);
err_cxt:
    xmlFreeParserCtxt(cxt);
err:
    if (irv && irv > -7) {
        free_safe(rv);
        *cfg = NULL;
    }
    else if (irv) {
        psocn_free_config(rv);
        *cfg = NULL;
    }

    return irv;
}

int psocn_web_server_loadfile(const char* onlinefile, char* dest) {
    int32_t filesize, ch2;
    uint16_t* w;
    uint16_t* w2;
    FILE* fp = { 0 };

    uint8_t msgdata[4096];

    size_t len = 0;
    errno_t err = fopen_s(&fp, onlinefile, "rb");
    if (err)
        ERR_EXIT("文件缺失了.请确保它在 %s 文件夹中", onlinefile);
    else {
        fseek(fp, 0, SEEK_END);
        filesize = ftell(fp);
        fseek(fp, 0, SEEK_SET);
        if (filesize > 4096)
            filesize = 4096;
        fread(&msgdata[0], 1, filesize, fp);
        fclose(fp);
        w = (uint16_t*)&msgdata[0];
        w2 = (uint16_t*)&dest[0];
        for (ch2 = 0; ch2 < filesize; ch2 += 2)
        {
            if (*w == 0x0024)
                *w = 0x0009;
            if (*w != 0x000D)
            {
                *(w2++) = *w;
                len += 2;
            }
            w++;
        }

        *w2 = 0x0000;

        return len;
    }
    return 0;
}

int psocn_web_server_getfile(void* HostName, int32_t port, char* file, const char* onlinefile) 
{
    struct hostent* hptr = gethostbyname((char*)HostName);

    //用域名获取对方主机名
    if (hptr == NULL) {
        return -1; //ERR_LOG("网络服务器连接失败,采用离线文件读取");
    }
    else
    {
        //printf(hptr->h_addr);

        //只支持IPV4
        if (hptr->h_addrtype != PF_INET) {
            //ERR_LOG("网络地址类型不是IPV4");
            return -1;
        }

        struct in_addr ina;
        //解析IP
        memmove(&ina, hptr->h_addr, 4);
        LPSTR ipstr = inet_ntoa(ina);

        //Socket封装
        struct sockaddr_in si = { 0 };
        si.sin_family = PF_INET;
        si.sin_port = htons(port);
        si.sin_addr.S_un.S_addr = inet_addr(ipstr);
        int sock = socket(PF_INET, SOCK_STREAM, IPPROTO_TCP);
        connect(sock, (SOCKADDR*)&si, sizeof(si));
        if (sock == SOCKET_ERROR || sock == -2) {
            PATCH_LOG("网络串口有误");
            return -1;
        }
        _wsetlocale(0, L"chs");
        char buf[255] = { 0 };
        char WebServer[255] = { 0 };
        int nRand = (uint32_t)time(NULL);
        snprintf(WebServer, sizeof(WebServer), "http://%s:%d%s?rand=%d", (char*)HostName, port, file, nRand);
        //printf("网络路径: %s\n", WebServer);
        if (_getcwd(buf, sizeof(buf))) {
            strcat(buf, "\\");
            strcat(buf, onlinefile);
            //printf("本地路径: %s\n", buf);
            URLDownloadToFileA(0, WebServer, buf, 0, NULL);
            return 0;
        }
        else
        {
            ERR_LOG("获取文件路径失败, 文件保存失败.");
            return -1;
        }

        closesocket(sock);
        WSACleanup();
    }
}
